# Data Cleaning

In [369]:
import pandas as pd
import numpy as np

In [370]:
Data_jobs = pd.read_csv(r"C:\Projects\Project_DM\Wuzzuf\Data_Inspection\Jobs")

In [371]:
text_cols = ['Title', 'company', 'location','job_type','work_mode','Experience_level','Experience_year','categories','department','skills']
for col in text_cols:
    Data_jobs[col] = Data_jobs[col].str.strip()

In [372]:
Data_jobs['Experience_year'] = Data_jobs['Experience_year'].str.split("-").str[0].str.strip()

In [373]:
Data_jobs['Experience_year']

0                               5
1                               3
2                               1
3                               1
4                               3
                   ...
10834              Administration
10835              Administration
10836              Administration
10837        Business Development
10838    Customer Service/Support
Name: Experience_year, Length: 10839, dtype: object

In [374]:
Data_jobs['Experience_year'] = Data_jobs['Experience_year'].apply(lambda x: int(x) if str(x).isdigit()else np.nan)

In [375]:
Data_jobs['Experience_year'] = Data_jobs['Experience_year'].fillna("Unknown")

In [376]:
Data_jobs['work_mode'] = Data_jobs['work_mode'].astype('category')
Data_jobs['job_type'] = Data_jobs['job_type'].astype('category')
Data_jobs['Experience_level'] = Data_jobs['Experience_level'].astype('category')
Data_jobs['categories'] = Data_jobs['categories'].astype('category')
Data_jobs['department'] = Data_jobs['department'].astype('category')

In [377]:
Data_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10839 entries, 0 to 10838
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             10839 non-null  object
 1   company           10839 non-null  object
 2   location          10839 non-null  object
 3   job_type          10839 non-null  category
 4   work_mode         6684 non-null   category
 5   Experience_level  10839 non-null  category
 6   Experience_year   10839 non-null  object
 7   categories        10839 non-null  category
 8   department        10839 non-null  category
 9   skills            10839 non-null  object
dtypes: category(5), object(5)
memory usage: 528.7+ KB

In [378]:
Data_jobs.drop_duplicates(inplace =True)

In [379]:
Data_jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8235 entries, 0 to 10837
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             8235 non-null   object
 1   company           8235 non-null   object
 2   location          8235 non-null   object
 3   job_type          8235 non-null   category
 4   work_mode         5183 non-null   category
 5   Experience_level  8235 non-null   category
 6   Experience_year   8235 non-null   object
 7   categories        8235 non-null   category
 8   department        8235 non-null   category
 9   skills            8235 non-null   object
dtypes: category(5), object(5)
memory usage: 475.9+ KB

In [380]:
duplicates = Data_jobs.duplicated().sum()
print(f"Number of duplicates: {duplicates}")

Number of duplicates: 0

In [381]:
Data_jobs['skills'] = Data_jobs['skills'].str.strip("[]")

In [382]:
Data_jobs['skills'] = Data_jobs['skills'].str.replace("'", "", regex=False)

In [383]:
Data_jobs['skills'] =  Data_jobs['skills'].str.split(', ')

In [384]:
Data_jobs['skills'][0]

['Database Management',
 'Python',
 'Data Analysis',
 'Machine Learning',
 'Data Visualization',
 'SQL',
 'ETL (Extract',
 'Transform',
 'Load)',
 'Big Data Technologies']

In [385]:
Data_jobs["Number_of_skills"] = Data_jobs["skills"].apply(lambda x: len(x))

In [386]:
Data_jobs['Number_of_skills']

0        10
1         9
2         3
3         8
4         8
         ..
10824     7
10827     7
10833     7
10834     7
10837     6
Name: Number_of_skills, Length: 8235, dtype: int64

In [387]:
Data_jobs.drop(columns=["skills"], inplace=True)

In [388]:
Data_jobs.head()

,Title,company,location,job_type,work_mode,Experience_level,Experience_year,categories,department,Number_of_skills
0,Data Scientist with Database Expertise,Confidential,"Riyadh, Saudi Arabia",Full Time,On-site,Experienced,5.0,IT/Software Development,Data Science,10
1,Data Analyst,Royal Herbs,"Haram, Giza, Egypt",Full Time,On-site,Experienced,3.0,Analyst/Research,Analyst/Research,9
2,Data Entry Specialist,El-Dahan Company,"Cairo, Egypt",Full Time,On-site,Entry Level,1.0,Administration,Administration,3
3,Junior Data Analyst,Yodawy,"Mohandessin, Giza, Egypt",Full Time,On-site,Entry Level,1.0,Logistics/Supply Chain,Operations/Management,8
4,Data Analytics Specialist,MEAHCO - Saudi German Health,"Katameya, Cairo, Egypt",Full Time,On-site,Experienced,3.0,Medical/Healthcare,Quality,8

In [389]:
Data_jobs['location'] = Data_jobs['location'].str.strip('"')

In [390]:
Data_jobs['location'] =  Data_jobs['location'].str.split(', ')

In [391]:
Data_jobs['location'] =  Data_jobs['location'].str[0]

In [392]:
Data_jobs['location']

0             Riyadh
1              Haram
2              Cairo
3        Mohandessin
4           Katameya
            ...
10824          Dubai
10827         Riyadh
10833         Riyadh
10834         Riyadh
10837         Riyadh
Name: location, Length: 8235, dtype: object

In [393]:
Data_jobs['work_mode'].unique()

['On-site', 'Hybrid', 'Remote', NaN]
Categories (3, object): ['Hybrid', 'On-site', 'Remote']

In [394]:
empty_count = Data_jobs['work_mode'].astype(str).str.strip().isin(["", "nan", "None"]).sum()
print(empty_count)

3052

In [395]:
Data_jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8235 entries, 0 to 10837
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             8235 non-null   object
 1   company           8235 non-null   object
 2   location          8235 non-null   object
 3   job_type          8235 non-null   category
 4   work_mode         5183 non-null   category
 5   Experience_level  8235 non-null   category
 6   Experience_year   8235 non-null   object
 7   categories        8235 non-null   category
 8   department        8235 non-null   category
 9   Number_of_skills  8235 non-null   int64
dtypes: category(5), int64(1), object(4)
memory usage: 733.9+ KB

In [396]:
Data_jobs.drop(columns=["work_mode"], inplace=True)

In [397]:
Data_jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8235 entries, 0 to 10837
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             8235 non-null   object
 1   company           8235 non-null   object
 2   location          8235 non-null   object
 3   job_type          8235 non-null   category
 4   Experience_level  8235 non-null   category
 5   Experience_year   8235 non-null   object
 6   categories        8235 non-null   category
 7   department        8235 non-null   category
 8   Number_of_skills  8235 non-null   int64
dtypes: category(4), int64(1), object(4)
memory usage: 725.7+ KB

In [398]:
Data_jobs.to_csv("cleaned_jobs.csv", index=False)